noarkexchange/src/test/resources/ephorte/PutMessageEmptyPayload.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
>
    <soap:Body>
        <PutMessageRequest xmlns="http://www.arkivverket.no/Noark/Exchange/types">
            <envelope conversationId="bb8323b9-1023-4046-b620-63c4f9120b62"
                      contentNamespace="http://www.arkivverket.no/Noark4-1-WS-WD/types" xmlns="">
                <sender>
                    <orgnr></orgnr>
                    <name>Sender name</name>
                    <email>senderemail@difi.no</email>
                    <ref>2016/1</ref>
                </sender>
                <receiver>
                    <orgnr>910075918</orgnr>
                    <name>Recipient name</name>
                    <email>recipientemail@difi.no</email>
                    <ref/>
                </receiver>
            </envelope>
            <payload xmlns=""></payload>
        </PutMessageRequest>
    </soap:Body>
</soap:Envelope>