noarkexchange-websak/src/test/resources/ephorte/EmptyPayload.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://www.arkivverket.no/Noark/Exchange/types">
    <soapenv:Body>
        <typ:PutMessageRequest>
            <envelope contentNamespace="?" conversationId="${=java.util.UUID.randomUUID()}">
                <sender>
                    <orgnr></orgnr>
                </sender>
                <receiver>
                    <orgnr></orgnr>
                </receiver>
            </envelope>
            <payload><![CDATA[<Melding xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.arkivverket.no/Noark4-1-WS-WD/types"><journpost xmlns=""><jpId>ePhorteTestAltOK</jpId><jpJaar>2015</jpJaar><jpSeknr>47</jpSeknr><jpJpostnr>7</jpJpostnr><jpJdato>0001-01-01</jpJdato><jpNdoktype>U</jpNdoktype><jpDokdato>2015-09-11</jpDokdato><jpStatus>R</jpStatus><jpInnhold>Testdokument 7</jpInnhold><jpForfdato /><jpTgkode>U</jpTgkode><jpAgdato /><jpAntved /><jpSaar>2015</jpSaar><jpSaseknr>20</jpSaseknr><jpOffinnhold>Testdokument 7</jpOffinnhold><jpTggruppnavn>Alle</jpTggruppnavn><avsmot><amIhtype>0</amIhtype><amNavn>Saksbehandler Testbruker7</amNavn><amAdresse>Postboks 8115 Dep.</amAdresse><amPostnr>0032</amPostnr><amPoststed>OSLO</amPoststed><amUtland>Norge</amUtland><amEpostadr>fadsfsad@difi.no</amEpostadr></avsmot><avsmot><amOrgnr>111111111</amOrgnr><amIhtype>1</amIhtype><amNavn>EduTestOrg 1</amNavn></avsmot><dokument><dlRnr>1</dlRnr><dlType>H</dlType><dbTittel>Testdokument 7</dbTittel><dbStatus>B</dbStatus><veVariant>P</veVariant><veDokformat>DOCX</veDokformat><fil><base64>gibberish</base64></fil><veFilnavn>Testdokument 7.DOCX</veFilnavn><veMimeType>application/vnd.openxmlformats-officedocument.wordprocessingml.document</veMimeType></dokument></journpost><noarksak xmlns=""><saId>15/00020</saId><saSaar>2015</saSaar><saSeknr>20</saSeknr><saPapir>0</saPapir><saDato>2015-09-01</saDato><saTittel>BEST/EDU testsak</saTittel><saStatus>R</saStatus><saArkdel>Sakarkiv 2013</saArkdel><saType>Sak</saType><saJenhet>Oslo</saJenhet><saTgkode>U</saTgkode><saBevtid /><saKasskode>B</saKasskode><saOfftittel>BEST/EDU testsak</saOfftittel><saAdmkort>444</saAdmkort><saAdmbet>Seksjon for test 1</saAdmbet><saAnsvinit>difi\teste</saAnsvinit><saAnsvnavn>Saksbehandler Testbruker7</saAnsvnavn><saTggruppnavn>Alle</saTggruppnavn><sakspart><spId>0</spId></sakspart></noarksak></Melding>]]></payload>
        </typ:PutMessageRequest>
    </soapenv:Body>
</soapenv:Envelope>
